Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
}


/**
Application callback function.  Called when this node receives a
ping response via IPv6
*/
void appSixlowpanPingResponse(void)
{
	#if (PLATFORM == RAVEN)
	// Send the 3290 a frame to show that we got a ping response.
	serial_send_frame(REPORT_PING_BEEP, 0, NULL);
	#endif
}

/**
Application callback function.  Called when this node receives a
UDP data packet.
*/
void appSixlowpanUdpResponse(char *str)
{
	#if (PLATFORM == RAVEN)
	// Send the 3290 a frame to show that we got a ping response.
	serial_send_frame(REPORT_TEXT_MSG, strlen(str), (u8*)str);
	#endif
}

/**
Application callback function, called when the MAC receives an ACK
packet from a node that we sent a packet to.
*/
void appPacketSendSucceed(void)
{
	// Reset the failure count on a good packet to parent
	// (could also decrement failCount)

	if (NODETYPE != COORD)
	{
		// figure out which way we were sending when the failure occurred
		if (macConfig.lastDestAddr == macConfig.parentShortAddress)
		failCount = 0;

		// Tell sensor app
		if (APP == SENSOR)
		sensorPacketSendSucceed();
		
	}
}

/**
Application callback function, called when the MAC fails to send a
packet due to a channel access failure (air is too busy).
*/
void appPacketSendAccessFail(void)
{
	// Tell sensor app
	#if (APP == SENSOR)
	sensorPacketSendFailed();
	#endif
}

/**
Application callback function, called when the MAC fails to receive
an ACK packet from a node that we sent a packet to.
*/
void appPacketSendFailed(void)
{
	//Tell 6LoWPAN
	#if IPV6LOWPAN
	// sixlowpanSleep_packetFailed();
	#endif

	u8 parentFailed;
	if (NODETYPE != COORD)
	{
		// don't mess with assessing failures during scanning
		if (macIsScanning())
		return;

		debugMsgStrConst("\r\nFail=");
		debugMsgInt(failCount+1);

		parentFailed = (macConfig.lastDestAddr == macConfig.parentShortAddress);
		/* Special code: this prevents a situation where the
		coordinator goes away, and the nodes take a long time to
		realize that the network is gone.  Nodes Keep trying to
		re-associate with each other, but until a router loses a
		number of packets to its parent, it still thinks it's
		associated.  This code forces the issue by either verifying
		that the router is still connected, or forcing a failure.    */
		// Send an empty data packet
		#if(NODETYPE == ROUTER)
		if ( parentFailed )
		macDataRequest(macConfig.parentShortAddress, 0, NULL);
		#endif
		// Don't have a cow until we have missed a few packets in a row
		if (++failCount < 3)
		{
			// Tell sensor app			//PPOS170720 APP = 0
			if (APP == SENSOR)
			sensorPacketSendFailed();
			return;
		}

		// A sent packet failed to reach its destination too many times
		// figure out which way we were sending when the failure occurred
		if (parentFailed)
		{
			// re-associate if we were sending upstream
			macConfig.associated = false;

			// It is possible to make the coord/end units re-connect
			// to the coordinator more quickly by not scanning all
			// available channels.  To do this, uncomment the following
			// line.
			//macSetScanChannel(macConfig.currentChannel);

			if (APP == SENSOR)
			sensorLostNetwork();
			else
			macSetAlarm(((radioRandom(8)+50) *30)+1000, appStartScan);
		}
		if (NODETYPE == ROUTER &&
		macIsChild(macConfig.lastDestAddr))
		{
			// Drop child from table if the failure was downstream
			macRemoveChild(macConfig.lastDestAddr);
			debugMsgStrConst("\r\nDropped child bcs packet send failed.");
		}
	}

}

#if DEBUG || DOXYGEN
/**
@brief This is an array of radio register names for serial output
used when rf2xx_reg_dump() is called.  See the radio
datasheet for details.
*/
u8 rf2xx_reg_names[][16] =
{"TRX_STATUS", "TRX_STATE", "TRX_CTRL_0", "TRX_CTRL_1", "PHY_TX_PWR",
	"PHY_RSSI", "PHY_ED_LEVEL", "PHY_CC_CCA", "CCA_THRES", "TRX_CTRL_2", "IRQ_MASK",
	"IRQ_STATUS", "VREG_CTRL", "BATMON", "XOSC_CTRL", "RX_SYN", "RF_CTRL_0", "XAH_CTRL_1",
	"FTN_CTRL", "RF_CTRL_1", "PLL_CF", "PLL_DCU", "PART_NUM", "VERSION_NUM", "MAN_ID_0",
	"MAN_ID_1", "SHORT_ADDR_0", "SHORT_ADDR_1", "PAN_ID_0", "PAN_ID_1",
	"IEEE_ADDR_0", "IEEE_ADDR_1", "IEEE_ADDR_2", "IEEE_ADDR_3", "IEEE_ADDR_4",
	"IEEE_ADDR_5", "IEEE_ADDR_6", "IEEE_ADDR_7", "XAH_CTRL_0", "CSMA_SEED_0",
"CSMA_SEED_1", "CSMA_BE"};

/**
@brief This is an array of radio register values to be used when
rf2xx_reg_dump() is called.  See the radio datasheet for
details.
*/
reg_addr_t rf2xx_reg_enum[] =
{RG_TRX_STATUS, RG_TRX_STATE, RG_TRX_CTRL_0, RG_TRX_CTRL_1, RG_PHY_TX_PWR,
	RG_PHY_RSSI, RG_PHY_ED_LEVEL, RG_PHY_CC_CCA, RG_CCA_THRES, RG_TRX_CTRL_2, RG_IRQ_MASK,
	RG_IRQ_STATUS, RG_VREG_CTRL, RG_BATMON, RG_XOSC_CTRL, RG_RX_SYN, RG_RF_CTRL_0, RG_XAH_CTRL_1,
	RG_FTN_CTRL, RG_RF_CTRL_0, RG_PLL_CF, RG_PLL_DCU, RG_PART_NUM, RG_VERSION_NUM, RG_MAN_ID_0,
	RG_MAN_ID_1, RG_SHORT_ADDR_0, RG_SHORT_ADDR_1, RG_PAN_ID_0, RG_PAN_ID_1,
	RG_IEEE_ADDR_0, RG_IEEE_ADDR_1, RG_IEEE_ADDR_2, RG_IEEE_ADDR_3, RG_IEEE_ADDR_4,
	RG_IEEE_ADDR_5, RG_IEEE_ADDR_6, RG_IEEE_ADDR_7, RG_XAH_CTRL_0, RG_CSMA_SEED_0,
RG_CSMA_SEED_1, RG_CSMA_BE};
#endif

/**
@brief Dumps the RF2xx register contents to serial port.

Note: The serial output will only be available if the @ref DEBUG
macro is defined as non-zero.
*/
void rf2xx_reg_dump(void)
{
	#if DEBUG
	{
		u8 i,j,k,val;
		s8 str[40];

		debugMsgStrConst("\r\n\r\nREG DUMP\r\n");

		k = sizeof(rf2xx_reg_enum)/sizeof(rf2xx_reg_enum[0]);

		for(i=0;i<k;i++)
		{
			val =  hal_register_read(rf2xx_reg_enum[i]);
			sprintf((char*)str,"%-15s - %02X ", (char *)rf2xx_reg_names[i], (uint16_t)val);
			debugMsgStr((char *)str);
			for (j=7;j<8;j--)
			// Print a bit
			debugMsgChr(((val >> j)&1 ? '1' : '0' ));
			debugMsgCrLf();
		}

		debugMsgStrConst("\r\n");
	}
	#endif
}

/**
Application function, sends a data frame to the coordinator, and
schedules another call in two seconds, using the timer function.

This can be used for testing the network.  To send a real data
frame, use macDataRequest().
*/
void appSendDataFrame(void)
{
	// send data frames once per second
	if (NODETYPE != COORD)
	macDataRequest(0x00, 4, (u8*) ((NODETYPE == ENDDEVICE) ? "endd" : "rout"));

	// Send another data frame later
	macSetAlarm(1000, appSendDataFrame);
}

/**
Callback function, called when the MAC receives a data packet for
this node.
*/
void appDataIndication(void)
{
	// Write app code here -- This node has received a data frame.

	// Example code:
	/* typedef struct { */
		/*     char buf[SAMPLE_COUNT/2];  // two samples/byte */
		/*     short step_index; */
		/*     short predicted_value; */
		/* } tEncodedBuf; */
		// Find out the type of packet.
		
		u8 i;
		static u8 ucDataLength;

		// Find out the type of packet
		ftData *frame = (ftData *)(mac_buffer_rx+1);
		
		u8 size = *mac_buffer_rx;

