Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
		ucSendDataSize = 0;

		// End_Device Radio ENTRY POINT
		if(size ==0)
		return;
		
		if ((frame->type & 0x7f) == DATA_FRAME)
		{

			// Get the length first.
			ucDataLength = frame->payload[0];
			memset(DataBuffer,0,sizeof(DataBuffer));

			for (i = 0; i < ucDataLength; i++)
			{
				DataBuffer[i] = frame->payload[i+1];
			}
			#if (DEBUG)
			Led3_on();
			#endif

			OP = extractIncomingMessage((char*)DataBuffer);
			
			#if (DEBUG)
			Led3_off();
			#endif
			ucNumberOfRetry = 0;
		}

	}


	/**
	Example function, starts the network by scanning channels for a coordinator.

	This node will either scan all available channels, or just one
	channel if @ref macSetScanChannel() is called.  @see macScan().
	*/
	void appStartScan(void)
	{
		if(NODETYPE != COORD)
		{
			#ifdef DEBUG_RADIO
			debugMsgStrConst("\r\nStart scan ");
			#endif

			//macSetScanChannel(0x0f);//BOW is operating only on this channel
			macInit(0xff);
			
			macScan();
		}

		//if (IPV6LOWPAN)  PPOS
		//sixlowpan_application_init();
	}

	/**
	Callback function, called when the MAC has associated a child of
	this node to the network.

	@param shortAddress The short address of the new child node that
	has been associated.  The MAC stores this address, so the
	application should not have to.
	*/
	void appChildAssociated(u16 shortAddress)
	{
		// Blip the LED when we associate a child
		LED_ON(2);
		macSetAlarm(LED_DELAY,ledoff2);
	}

	/**
	Callback function, called when the MAC has associated a new node to
	a network. This is only called for the coordinator.

	@param shortAddress The short address assigned to the new node.  The
	MAC stores this address, so the application should not have to.
	*/
	void appNodeAssociated(u16 shortAddress)
	{
	}


	/**
	Callback function, called when the MAC receives an association
	confirm packet addressed to this node, or the process timed out.

	@param success True if an association packet was received, or false
	if the association process timed out.
	*/
	void appAssociateConfirm(u8 success)
	{
		if(NODETYPE != COORD)
		{
			if (success == SUCCESS)
			{
				// send data frame after a bit
				#ifdef DEBUG_RADIO
				debugMsgStrConst("\r\nAssociated to ");
				debugMsgHex(macConfig.parentShortAddress);
				debugMsgStrConst(" as ");
				debugMsgHex(macConfig.shortAddress);
				#endif


				LED_ON(2);
				macSetAlarm(LED_DELAY,ledoff2);

				// For raven, notify other processor
				#if ((PLATFORM == RAVEN) && SERIAL)
				serial_send_frame(REPORT_ASSOCIATED, 2, (u8*)&macConfig.shortAddress);
				#endif
				
				/* 6lowpan association */
				if (IPV6LOWPAN)
				sixlowpan_hc01_gen_rs();
				
				// If we are auto-sending data, start that process.
				#if ((APP == SENSOR) && (NODETYPE != COORD))
				{
					sensorInit();
					sensorAutoSendStart();
				}
				#endif
				
				
				
			}
			else
			{
				debugMsgStrConst("\r\nFailed to associate");
				/*		PPOS170720 not sure about this
				if (VLP)
				{
				// Sleep for 10 seconds, try again
				nodeSleep(100);
				appStartScan();
				}
				else
				// Try again in one second
				//macSetAlarm(1000, appStartScan);
				macSetAlarm(((radioRandom(8)+50) *30)+1000, appStartScan);
				*/
			}
		}
	}

	/**
	Pinpoint Reader application function, associates this node to a network.
	This function is called after a successful @ref macScan.
	*/
	void appAssociate(void)
	{
		#ifdef DEBUG_RADIO
		debugMsgStrConst("\r\nAssociating to ");
		debugMsgHex(panDescriptor.coordAddr);
		debugMsgStrConst(" on ch ");
		debugMsgInt(panDescriptor.logicalChannel);
		debugMsgStrConst(", hops = ");
		debugMsgInt(panDescriptor.hopsToCoord);
		#endif

		macAssociate(panDescriptor.coordAddr, panDescriptor.logicalChannel);
	}

	/**
	Callback function, called when the MAC has completed its channel scan.

	@param success True if @ref macScan found a network to connect to,
	or false if no networks were found.
	*/
	void appScanConfirm(u8 success)
	{
		// Write app code here -- This (end or router) node has finished its scan,
		// and has received some beacons from prospective parents.

		// Example code:
		if(NODETYPE != COORD)
		{
			if (success)
			{
				// associate with coordinator
				macSetAlarm(30,appAssociate);

				#ifdef DEBUG_RADIO
				debugMsgStrConst("\r\nScan good, select chan ");
				debugMsgInt(panDescriptor.logicalChannel);
				#endif
			}
			else
			{
				// failure to find a network
				if (VLP)
				{
					// Try again after sleeping for 10 seconds
					if (NODETYPE == ENDDEVICE)
					nodeSleep(100);
					else
					// Router node
					macSetAlarm(1000, appStartScan);
				}
				else
				//macSetLongAlarm(30,appStartScan);// time between scan attempts
				macSetAlarm((radioRandom(8)+5) *10, appStartScan);
				
				debugMsgStrConst("\r\nScan bad");
			}
		}
	}

	/**
	Callback function, called when @ref macFindClearChannel()
	completes.

	u8 channel The clear channel selected for use by this PAN.
	*/
	void appClearChanFound(u8 channel)
	{
		if (NODETYPE == COORD)
		{
			macInit(channel);
			macStartCoord();
			#if (__AVR__ || __AVR32__)
			debugMsgStrConst("\r\nStartup, I am coordinator on ch ");
			#else
			fnDebugMsg("\r\nStartup, I am coordinator on ch ");
			#endif // __AVR__
			debugMsgInt(channel);
			macConfig.associated = true;

			#if ((IPV6_STACK == STACK_UIP) && IPV6LOWPAN)
			//Start uIP stack with 802.15.4 interface
			huip_init_802154(macConfig.panId, macConfig.shortAddress);
			#endif // IPV6LOWPAN
		}
	}

	#if __AVR__
	/**
	Verifies that the EEPROM contains valid data for the stored MAC
	address.  If the EEPROM is unprogrammed, then a random MAC address
	is written into EEPROM.
	Similarly, the reader state is set to ? if the EEPROM is unprogrammed.
	*/
	void checkEeprom(void)
	{
		//check for First Run
		if(PLATFORM == RCBRFA1)
		{
			u64 NodeLongAddress;
			u32 low;
			u32 high;
			u8 regval;
			u8  i=0;
			
			u8 temp = READER_NEW;
			
			// Setup the address of this device by reading a stored address from eeprom.
			halGetMacAddr((u8*)&(NodeLongAddress));
			
