Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
			// Partition the long address
			low = NodeLongAddress & 0xffffffff;
			high = NodeLongAddress >> 32;
			
			// Virgin Board Configuration Found,
			// Request Setup Info from Reader
			if((low == 0xFFFFFFFF) && (high == 0xFFFFFFFF)){
				// Produce Random Number
				
				u8 buf[8];
				u8 bits =8;

				memset(&buf,0,sizeof(buf));
				// create random MAC address and store it
				radioInit(0); // Needed for random to work.
				radioSetTrxState(RX_ON);

				
				for (u8 x = 0;x < 8;x++){

					
					if(x < 4)
					buf[x] = 0xFF;			// Load lower 4-bytes w/ 0xFF

					else{
						
						i = radioGetTrxState();

						// Load upper 4-bytes w/ random number (4-bytes)
						if(i == RX_ON || i == RX_AACK_ON)
						// Must be in rx to get random numbers
						// Random number generator on-board
						// has two random bits each read
						for (i=0;i<bits/2;i++)
						{
							regval = hal_subregister_read(SR_RND_VALUE);
							buf[x]= (buf[x] << 2) | regval;
						}
					}
				}
				
				halPutMacAddr(buf);
				
				halPutEeprom(READER_STATE_ADDR,2,&temp);
				eeprom_update_byte(MACHINE_LABEL_ADDR, 0); //make label empty string
				eeprom_update_byte(MACHINE_DESCRIPTION_ADDR, 0); //make description empty string
			}

			else if((low == 0xFFFFFFFF) && (high != 0x00000000)){
				
				halPutEeprom(READER_STATE_ADDR,2,&temp);
				asm("nop");
			}
			
			
		}
	}
	#endif // __AVR__



	/**
	Pinpoint Reader application function, which initializes the PPOS application.
	This function is meant to be called on startup only.
	Initializes reader with initReader()
	Initializes ACA machines calling machine status
	Set flags: VALIDATE_READER
	ucDeviceStateFlag
	*/
	void appInit(void)
	{
		u8 machineCode;
		u8 tmp=0;
		u8 machineTimerId;
		
		// Init the mac
		LED_INIT();
		Leds_on();
		Buzzer_init();
		Leds_off();

		// Blip the LED once on powerup
		Led1_on();
		//read validation code
		OP = VALIDATE_READER;
		macSetAlarm(25, ledoff1);
		//communicate with machines
		ucDeviceStateFlag = DEVICE_STATUS_NEEDED;  //true
		
		#if (__AVR__)
		// If the EEPROM is cleared, init it to something useful
		checkEeprom();
		#endif // __AVR__
		
		initReader();

		
		#ifdef MACHINE_CONNECTED
		
		//wait up to 10 seconds for machine to become active
		machineTimerId = macSetAlarm(MACHINE_WAIT_TIMEOUT,WaitForMachine);
		
		while(ucMachineWait == MACHINE_WAIT)
		{
			if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)	//true
			{
				//If True, Machine Status has been completed, ucDeviceStateFlag set to MACHINE_STATUS_ON
				SQACAInitializationSequence();
				
				tmp = macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
			}
			else if(ucDeviceStateFlag == MACHINE_STATUS_ON)		//false
			{
				//don't wait anymore
				macTimerEnd(machineTimerId);
				macTimerEnd(tmp);
				
				break;
			}
			else if( mac_event_pending() )
			{
				macTask();  //timer has timed out handle timer task.
			}
			
		}
		macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);
		

		
		#else
		// FOR DEBUGGING USE ONLY
		//MdcStatus.MachineType[0] = 0x21;		//PPOS
		//MdcStatus.MachineType[1] = 1;			//PPOS
		
		#endif
		/*
		#if (DEBUG == 0)
		//start heartbeat
		HeartBeat();
		#endif
		*/
		#if (DEVICE_CONNECTED == ACA_MACHINE)
		// read machine code stored in EEPROM
		/********can check reader state flag here and update******/
		halGetEeprom(MACHINE_TYPE_ADDR,1,&machineCode);
		
		//if a valid machine is connected, then store the machine type
		if((machineCode == 0xFF) && (SQACAMachineStatus.MachineType[0] != INVALID_MACHINE))
		{
			// save the actual machine code
			halPutEeprom(MACHINE_TYPE_ADDR,1,&SQACAMachineStatus.MachineType[0]);
			halPutEeprom(MACHINE_TYPE_ADDR+1,1,&SQACAMachineStatus.MachineType[1]);
		}
		else if(SQACAMachineStatus.MachineType[0] != machineCode)
		{
			// machine has been swapped - trigger setup request
			halPutEeprom(MACHINE_TYPE_ADDR,1,&SQACAMachineStatus.MachineType[0]);
			halPutEeprom(MACHINE_TYPE_ADDR+1,1,&SQACAMachineStatus.MachineType[1]);
			
			ReaderStateFlag.ReaderSetup = READER_SETUP_NEEDED;			//(ReaderStateFlag | READER_SETUP_NEEDED);
			halPutEeprom(READER_STATE_ADDR,1,(u8*)&ReaderStateFlag);
		}
		
		
		#endif //DEVICE_CONNECTED

		// Init the mac and stuff
		if (NODETYPE == COORD)
		{
			//macFindClearChannel(); PPOS
		}
		else
		{
			#ifdef DEBUG_RADIO
			debugMsgStrConst("\r\nStartup, I am router/end.");
			#endif

			// End node or router, start scanning for a coordinator
			appStartScan();
			// when scan is finished, appScanConfirm will be called.

			//Call RUM init
			sixlowpan_init();

			#ifndef COORDNODE

			
			if (ucDeviceStateFlag == MACHINE_STATUS_ON)
			{
				//display current Firmware version
				displaySQReaderVersion();
				
				//Send machine setup at every power up if reader has setup and machine is connected
				if( ReaderStateFlag.ReaderSetup == READER_SETUP_DONE )
				{
					// get ACA Programming data
					getSQReaderMachineSetup();			// get PROGRAMMING_DATA_TOPLOAD, _DRYER, _FRONTLOADER
					
				}
			}
			

			#endif

		}
		
		asm("nop");
	}

	/**
	Pinpoint Reader application function. Sends a ping packet to the network
	coordinator.
	*/
	void doPing(void)
	{
		hal_register_write(RG_CSMA_BE,0);
		
		macPing(PING_REQ_FRAME, DEFAULT_COORD_ADDR);

		// Uncomment the next line to make the button unleash a torrent of pings
		#if __AVR__ || __AVR32__
		//    pingTimer = macSetAlarmMs(5+(23*(BAND == BAND900)), doPing);
		if (pingTimer)
		{
			macTimerEnd(pingTimer);
		}
		pingTimer = macSetAlarm(10000, doPing);
		#endif
	}


	

	/**
	Pinpoint Reader application task loop function.  This function is meant to
	be called periodically.  It receives data from serial and sends it
	to end device. Machine status communication occur every 1/2 second.
	appTask calls function:
	DevicePoll
	if associated true
	switch OP
	appInit
	sendBOWSetupRequest
	sendBOWValidationRequest
	sendBOWCCTransaction
	macSetLongAlarm
	ValidationTimeout
	isMachineCycleRunning
	AnticollSelect
	readCardID
	SQACAMimicQuantumSequence
	waitForMachineStartKey
	KeypressTimeOut
	Beeps
	CommTimeOut
	sendSQACAVendingTransaction
	SetupTimeout
	GetParam
	
	*/

	/**
	@brief This is the main loop task for the Application.  Called by the main
	"forever" loop.  This function processes application tasks
	*/
	void appTask(void)				//called by appInit()
	{
		//vars declaration
		ucSendDataSize = 0;
		unsigned char tmp[16];

