Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
		u8 ucTimerID=0xff;
		char *uctempBuf;
		char *ptr;
		
		u8 k, l;
		u8  Setup[30];
		u8 n = 0;
		
		u8 cardNum[10] = {0};
		
		#ifdef MACHINE_CONNECTED
		
		if(ucDeviceStateFlag == DEVICE_STATUS_NEEDED)	//do machine status communication every 1/2 second
		{
			DevicePoll();
			
			
			//still online
			if (ucDeviceStateFlag == MACHINE_STATUS_ON)			//machine status 33, 41, 43 online
			{
				_delay_ms(5);
				//invalid machinecode
				if (ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED)
				{
					//Display "No Setup" message on machine
					displayMsg(SETUP_MSG);
				}
				else if (((macConfig.associated == false) && (ReaderStateFlag.EnableOfflineTransaction == false)) || (ReaderStateFlag.MaxNumTransReached == true))
				{
					//Display "Service message" message on machine
					displayMsg(SERVICE_MSG);
				}
				else if (ReaderStateFlag.Busy == true)
				{
					
					//Display busy message
					if( OP != GET_BALANCE_FROM_SERVER ) // ****need to put op code in a queue****
					{
						OP = GET_BALANCE_FROM_SERVER;
					}
					displayMsg(BUSY_MSG);
					
				}
			}
			else
			{
				// machine is not online, print error message
				displayMsg(CABLE_MSG);
			}
		}
		
		#endif

		if(macConfig.associated == true || ReaderStateFlag.EnableOfflineTransaction == true) //  Don't bother running the app until the reader has associated
		{
			//
			switch(OP)
			{
				//case #1 called by appInit
				case VALIDATE_READER:
				//TODO: fix machine type switch
				
				if((ReaderStateFlag.EnableOfflineTransaction == true) && (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE))
				{
					OP = INIT_READER;
				}
				else{
					
					if( ((ReaderStateFlag.ReaderSetup == READER_SETUP_NEEDED) || ( ReaderStateFlag.FirstRun == VIRGIN_READER)) && (SQACAMachineStatus.MachineType[0] != INVALID_MACHINE) )
					{
						SETUP_TIMEOUT = true;
						OP = SETUP_REQUEST; //enable when setup supported by server
						
					}
					else if( (ReaderStateFlag.ReaderSetup == READER_SETUP_DONE) && (ReaderStateFlag.ValidateSetup == VALIDATE_READER_SETUP) )
					{
						VALIDATION_TIMEOUT = false;
						sendBOWValidationRequest();
						// Clear Rx Buffer
						memset(DataBuffer,0,sizeof(DataBuffer));
						
						macSetLongAlarm(SETUP_VALIDATION_TIMEOUT, ValidationTimeout); 		//check Every 15s

						// Wait for validation package to arrive
						OP = VALIDATE_SETUP;
						
					}
					else if( ReaderStateFlag.ReaderSetup == READER_SETUP_DONE)
					{
						OP = INIT_READER;
					}
				}
				
				
				//case #2
				case INIT_READER:
				
				if( isMachineCycleRunning() )
				{
					OP = CYCLE_RUNNING;
				}
				else
				{
					OP = SCANNING;
				}
				
				break;

				//case #3 called by case #2 scan for card swipe
				case SCANNING:
				// Enable Heart beat routine
				if (uiFunctionEntered < (20 * (F_CPU/4000000)))
				{
					uiFunctionEntered++;
				}
				else
				{
					Led1_toggle();
					
					uiFunctionEntered = 0;
				}
				
				if(!Request(ISO14443_3_REQALL, tmp))
				{
					u8 cardType;
					u8 cardKey[6] = {0xff,0xff,0xff,0xff,0xff,0xff};
					
					/*anti-collision and select the card*/
					
					if(!AnticollSelect(0, tmp, &cardType))
					{
						if(cardType == MIFARE_1K)
						{
							CurrentAccount.Type = MIFARE_1K;
							
							Authentication(MIFARE_AUTHENT_A,cardKey,tmp,0);
						}
						else
						{
							CurrentAccount.Type = 0;
						}
						OP = CARD_DETECTED;
						ledoff1();
					}
				}
				break;
				
				//case #4
				case CARD_DETECTED:
				
				//Read CardID from User Zone
				if(!readCardID(CurrentAccount.Type, &cardNum[0]))
				{
					padLeft((char*)&cardNum[0],9,"200");
					
					CurrentAccount.ID = strtoul((const char*)cardNum,NULL,10);	//save active card's id
					//associated?
					if(macConfig.associated == true)
					{
						// Send Data Package via Radio
						sprintf((char*)ucSendDataBuffer+1, "<sN>%s</sN>",cardNum);

						ucSendDataSize = strlen((char*)ucSendDataBuffer+1);
						ucSendDataBuffer[0] = ucSendDataSize;   // Length
						ucSendDataSize = ucSendDataSize + 1;    // data size = data byte + size byte
						macDataRequest(DEFAULT_COORD_ADDR, ucSendDataSize, ucSendDataBuffer);
						
						// Clear Rx Buffer
						memset(DataBuffer,0,sizeof(DataBuffer));
						
						OP = GET_BALANCE_FROM_SERVER;
						//set busy msg flag
						ReaderStateFlag.Busy = true;
						
					}
					//not associated
					else if((isAssociated() == false) && (ReaderStateFlag.MaxNumTransReached == false))
					{
						//allow cycle to start when BOW is down
						//CurrentAccount.Value = vendPrice * 100;  PPOS
						CurrentAccount.Value = (uctempBuf[0]-0x30) * 1000 + (uctempBuf[1]-0x30) * 100 + (uctempBuf[3]-0x30) * 10 + uctempBuf[4]-0x30;
						
						if (SQACAMachineStatus.MachineStatus[0] == MACHINE_READY_MODE)
						{
							sendSQACAMimicQuantumVending();

							OP = WAIT_FOR_SELECTION;
							
							KPTOFlag = 0;
							
							if( waitForMachineStartKey() )
							{
								macSetLongAlarm(MACHINE_KEYPRESS_WAITTIME,KeypressTimeOut);		//KeyPressWaitTime
							}
							else
							macSetAlarm(500, KeypressTimeOut); // if connected to a washer while cycle is running and a card is swiped, just display the balance and continue scanning.
							
						}
					}
					else
					{
						OP = SCANNING;
					}
					
					#if (DEBUG)
					Beeps(1);
					#endif

					//Set Timeout timer 60secs for every read
					TOFlag = false;
					ucTimerID = macSetLongAlarm(SERVER_RESPONSE_TIMEOUT,CommTimeOut);
				}
				else  //card read
				{
					#if (DEBUG)
					debugMsgStr("\r\nInvalid CardID\r\n");
					#endif
					OP = SCANNING;  //old SCARD_REMOVED
				}
				
				break;

				//case #5
				case SEND_OFFLINE_TRANSACTIONS:
				
				if (timeout.sendingOfflineTransactions)
				{
					timeout.sendingOfflineTransactions = false;
					OP = IDLE;
				}
				break;
				
				case SHOW_BALANCE_REQUEST:

				//case #6 called by case 4# wait for response from server after card swipe
				case GET_BALANCE_FROM_SERVER:
				if(DataBuffer[0] != '\0')	//coming from OP = extractIncomingMessage()
				{
					// Print response
					ReaderStateFlag.Busy = false;
					#if (DEBUG_BOW)
					debugMsgStr("\r\n");
					debugMsgStr(DataBuffer);
					debugMsgStr("\r\n");
					#endif

					OP = SCANNING;  // old SCARD_REMOVED
					
					//Extract the Card Id from the incoming message
					if( (uctempBuf = strstr((char *)DataBuffer,"sN: ")) )
					{
						CurrentAccount.ID = strtoul((const char*)(uctempBuf+4),NULL,10);	//save active card's id
						
						//Display card balance on machine
						double fBalance = 0.0;
						
