Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
						uctempBuf = strstr((char *)DataBuffer,"Balance: ");
						uctempBuf += 9;
						ptr = strchr(uctempBuf,'.');
						k = ptr - uctempBuf;
						fBalance = atof(uctempBuf);
						
						// Format the Balance to XX.XX
						//capture numeric into string
						if (k <2)
						sprintf(uctempBuf,"0%.2f",fBalance);
						else if(k == 2)
						sprintf(uctempBuf,"%.2f",fBalance);
						else
						strcpy(uctempBuf,"99.99");
						
						//split string into individual values, skip decimal point
						CurrentAccount.Value = (uctempBuf[0]-0x30) * 1000 + (uctempBuf[1]-0x30) * 100 + (uctempBuf[3]-0x30) * 10 + uctempBuf[4]-0x30;
						
						// give display control back to front end controller. Important! Don't forget!!!!
						//displaySQBalance(fBalance); needs fixing
						sendSQDisplayCommand(msgNumber[uctempBuf[0]-0x30], msgNumber[uctempBuf[1]-0x30], msgNumber[uctempBuf[3]-0x30], msgNumber[uctempBuf[4]-0x30], LED_BLANK, LED_BLANK,10);
						_delay_ms(100);

						if (SQACAMachineStatus.MachineStatus[0] == MACHINE_READY_MODE)
						{
							sendSQACAMimicQuantumVending();
							
							#if(DEBUG_BOW)
							debugMsgStr("\r\nsendSQACAMimicQuantumVending()\r\n");
							#endif
							OP = WAIT_FOR_SELECTION; 	// ...wait for Start Pad Selection
							
							//Sound Buzzer
							#if (DEBUG)
							Beeps(2);
							#endif
							
							KPTOFlag = 0;								//KeyPressTimeout false
							//Examine machine control and the current status of the machine (Primary and Secondary Modes)
							if( waitForMachineStartKey() )
							{
								macSetLongAlarm(MACHINE_KEYPRESS_WAITTIME, KeypressTimeOut);		//15secs 
							}
							else
							// code to avoid multiple button press
							macSetAlarm(500, KeypressTimeOut);		//if connected to a washer while cycle is running and a card is swiped, just display the balance and continue scanning.
							
						}
						//initiate TopOff
						else if( (SQACAMachineStatus.MachineStatus[0] == MACHINE_RUN_MODE) && (SQACAMachineStatus.MachineType[0] == PROGRAMMING_DATA_DRYER) )
						{
							OP = DRYERCYCLE_RUNNING;
						}
					}	//serial number found in server database
					//force timeout condition
					else //serial number error from server database
					{
						CommTimeOut();					//TOFlag = true;
					}

				} // end if
				//still case 6# server fails to respond in time no balance
				else if(TOFlag == true || macConfig.associated == false)
				{
					#if(DEBUG_BOW)
					debugMsgStr("\r\nTOFlag == 1\r\n");
					#endif

					// Error Occured, Re-enter SCANNING mode
					ReaderStateFlag.Busy = false;
					//send error message to machine display
					displayMsg(CARD_ERR_MSG);
					OP = IDLE;
					
					#if (DEBUG_BOW)
					debugMsgStr("\r\nServer Communication Error\r\n");
					#endif
				}
				//asm("nop");
				break;

				//case #7 called by case #6 SCANNING
				case WAIT_FOR_SELECTION:			//wait to see if cycle start has been requested by user
				//either press the start button
				_delay_ms(2000); //PPOS 170706 without this delay the Start button will not work
				if( SQACAMachineStatus.CmdToReader == START_PAD_PRESSED )
				{
					OP = START_CYCLE;				//Start Pad was pressed ...you have 10secs to pay and to start in Run mode
				}

				else if(KPTOFlag == 1)  //...or not, but state it
				{
					OP = SCANNING;
				}
				break;

				//case #8 Start Regular vend called by case #7 WAIT_FOR_SELECTION
				case START_CYCLE:
				//The Payment System sends this packet to the Machine Control to perform a vending transaction.
				if( sendSQACAVendingTransaction(REGULAR_VEND) )
				{
					vendPrice = SQACAMachineStatus.RemainingVend[1] * 256 + SQACAMachineStatus.RemainingVend[0];
					//getSQVend(&vend); will replace the next 7 lines
					structTransaction vend;
					vend.CardId			= CurrentAccount.ID;
					vend.vendPrice		= vendPrice ;
					vend.LocationId		= ReaderSetup.locationId;
					vend.ManufactureId	= ReaderSetup.manufacturerId;
					vend.MachineId[0]	= deviceStatus.deviceType[0];
					vend.MachineId[1]	= deviceStatus.deviceType[1];
					
					if((isAssociated() == false))
					{//must be offline transaction, store a record.
						vend.isOffline = true;
						storeOfflineTransaction(CurrentAccount.ID);
					}
					//The reader sends this packet to the BOW to record a vending transaction.
					else
					{
						vend.isOffline = false;
						CurrentAccount.Value -= vendPrice;
						sendBOWCCTransaction(&vend);
					}
					OP = CYCLE_RUNNING;						//PPOS review Error handling?
				}
				
				break;

				//old code needs review
				//case #9  called by case #2 INIT_READER and case #8 START_CYCLE
				case CYCLE_RUNNING: // WASH COMPLETED
				OP = SCANNING;
				break;

				//case #9A Purchase TopOff called by case #6 GET_BALANCE_FROM_SERVER
				case DRYERCYCLE_RUNNING:
				//The Payment System sends this packet to the Machine Control to perform a TopOff vending transaction.
				if( sendSQACAVendingTransaction(TOPOFF_VEND) )
				{
					displaySQTopOffvend(vendPrice);
					
					vendPrice = SQACADryerProgramming.PaymSTopoffPrice[1] * 256 + SQACADryerProgramming.PaymSTopoffPrice[0];
					//getSQVend(&vend); //replaces the next 7 lines
					structTransaction vend;
					vend.CardId			= CurrentAccount.ID;
					vend.vendPrice		= vendPrice ;
					vend.LocationId		= ReaderSetup.locationId;
					vend.ManufactureId	= ReaderSetup.manufacturerId;
					vend.MachineId[0]	= deviceStatus.deviceType[0];
					vend.MachineId[1]	= deviceStatus.deviceType[1];
					
					if((isAssociated() == false))
					{//must be offline transaction, store a record.
						vend.isOffline = true;
						storeOfflineTransaction(CurrentAccount.ID);
						
					}
					//The reader sends this packet to the BOW to record a vending transaction.
					else
					{
						vend.isOffline = false;
						CurrentAccount.Value -= vendPrice;
						sendBOWCCTransaction(&vend);
					}
					OP = SCANNING;						//let server know machine is in use.
				}
				
				break;

				//case #10
				case TIME_OUT: // Server Communication Error Occurred
				break;

				//case #11
				case SETUP_REQUEST:
				if( SETUP_TIMEOUT == true)
				{
					#ifdef MACHINE_CONNECTED
					DevicePoll();
					
					#else
					deviceStatus.deviceType[0] = 33;
					deviceStatus.deviceType[1] = 1;
					
