Waldulmer/ATmega128RFA1-AT86RF231-Reader-Firmware17/Reader_Gen/Application/application.c
					#endif //MACHINE_CONNECTED
					sendBOWSetupRequest();
					
					SETUP_TIMEOUT = false;
					macSetLongAlarm(SETUP_REQUEST_TIMEOUT, SetupTimeout);
				}
				break;
				
				
				//case #12
				case VALIDATE_SETUP:
				if((ptr = GetParam((char *)DataBuffer,"<ValidationResponse>","<")) != NULL)
				{
					u8 addr[8];
					static u8 Len = 0;
					n = strlen(ptr);
					k = 0;
					l = 0;
					
					// Get length of Validation code
					halGetEeprom(VALIDATION_CODE_ADDR, 1, &Len);
					
					// 	Get Validation Code from EEPROM
					halGetEeprom(((u8*)VALIDATION_CODE_ADDR+1), Len, addr);
					
					while (k < n)
					{
						Setup[l] = (Ascii_to_nible ( *(ptr+k) ) * 16)
						+  Ascii_to_nible ( *(ptr+k+1));
						k += 2;
						l++;
					}

					if(memcmp(addr,Setup,Len) == 0)
					{
						ReaderStateFlag.ValidateSetup = VALID_READER_SETUP; //Don't store this bit in eeprom it allows for validation check on every power cycle.
						OP = VALIDATE_READER;
					}
					else
					{
						
						OP = SETUP_REQUEST; // validation failed, request new setup info
						SETUP_TIMEOUT = true;
						
					}
				}

				// Response TIMEOUT
				if(VALIDATION_TIMEOUT)
				{
					VALIDATION_TIMEOUT = false;
					sendBOWValidationRequest();// Re-send Validation Request
					
					macSetLongAlarm(SETUP_VALIDATION_TIMEOUT, ValidationTimeout); 		//check Every 5s
				}
				
				break;
				//case #13 process firmware update request from BOW

				case UPDATE_READER_FIRMWARE:
				break;

				//case #14
				case IDLE:
				OP = SCANNING;
				break;

				//case #16 BOW sending error codes
				case BOW_ERROR:
				OP = IDLE;
				break;

				//case #17 Re-associate with COORD using new ReaderID
				case APP_INIT:
				appInit();
				break;

				//case #18
				case AUDITDATA_REQUEST:
				sendBOWAuditDataRequest() ;
				break;
				
				default:
				break;
			} //switch OP


		}// macConfig.associated
		
	}//appTask

	/************************************************************************/
	/*                                                                      */
	/************************************************************************/
	void ValidationTimeout()
	{
		VALIDATION_TIMEOUT = true;
	}

	/************************************************************************/
	/*  This function copies no more than size bytes from from to to, stopping if a
	byte matching c is found. The return value is a pointer into to one byte past where c was copied,
	or a null pointer if no byte matching c appeared in the first size bytes of from.                                                                   */
	/************************************************************************/
	char * GetParam(char *ptrBuffer, char *tmpstr, char *EndChar)
	{
		char *pStr;
		char *pStr2;
		u8 tmpstrlen =0;

		tmpstrlen = strlen(tmpstr);

		if((pStr = strstr(ptrBuffer,tmpstr)) != NULL)
		{ //1
			if((pStr2 = strstr(pStr + tmpstrlen,EndChar)) != NULL)
			{ //2 "<"
				memcpy(ParamStr,pStr + tmpstrlen, pStr2-(pStr+tmpstrlen));
				ParamStr[pStr2-(pStr + tmpstrlen)]  ='\0';

				return (char *)ParamStr;
			}//1
		}//2
		
		return '\0';
	}


	#ifndef COORDNODE

	void Beeps(u8 nBeeps)
	{
		for(u8 i= 0; i < nBeeps;i++)
		{
			for(u16 i= 0; i < 100;i++)
			{
				Buzzer_on();
				_delay_us(200);
				Buzzer_off();
				_delay_us(200);
			}
			_delay_ms(25);
		}
	}

	void CommTimeOut()
	{
		TOFlag = true;
		ReaderStateFlag.Busy = false;
	}

	void KeypressTimeOut()
	{
		KPTOFlag = true;
	}

	void HeartBeat()
	{
		static u8 ucHeartBeatTimer = 0;
		if( ucHeartBeatTimer != 0 )
		macTimerEnd(ucHeartBeatTimer);
		Led2_toggle();
		ucHeartBeatTimer = macSetAlarm(HEARTBEAT, HeartBeat);
	}

	void SetupTimeout()
	{
		SETUP_TIMEOUT = true;
	}

	#if (DEBUG_BOW)

	void DetermineState()
	{

		switch (OP)
		{

			case SETUP_RESPONSE:
			debugMsgStr("\n\rSETUP_RESPONSE:\n\r");
			break;

			case SETUP_REQUEST:
			debugMsgStr("\n\rSETUP_REQUEST:\n\r");
			break;

			case SETUP_PACKAGE:
			debugMsgStr("\n\rUPDATE_READERID:\n\r");
			break;

			case INIT_READER:
			debugMsgStr("\n\rINIT_READER:\n\r");
			break;
			
			case SCANNING:
			debugMsgStr("\n\rSCANNING:\n\r");
			break;

			case CARD_DETECTED:
			debugMsgStr("\n\rCARD_DETECTED:\n\r");
			break;

			case CYCLE_RUNNING:
			debugMsgStr("\n\rCYCLE_RUNNING:\n\r");
			break;

			case SCAN_ENABLE:
			debugMsgStr("\n\rSCAN_ENABLE:\n\r");
			break;

			case DISABLE_SCAN:
			debugMsgStr("\n\rDISABLE_SCAN:\n\r");
			break;

			case WAIT_FOR_RESPONSE:
			debugMsgStr("\n\rWAIT_FOR_RESPONSE:\n\r");
			break;

			case TIME_OUT:
			debugMsgStr("\n\rTIME_OUT:\n\r");
			break;

			case WAIT_FOR_SELECTION:
			debugMsgStr("\n\rWAIT_FOR_SELECTION:\n\r");
			break;

			case ENABLE_SCAN:
			debugMsgStr("\n\rENABLE_SCAN:\n\r");
			break;

			case SCARD_REMOVED:
			debugMsgStr("\n\rSCARD_REMOVED:\n\r");
			break;

			case START_CYCLE:
			debugMsgStr("\n\rSTART_CYCLE:\n\r");
			break;

			default:
			break;
			
		}

	}
	#endif // (DEBUG_BOW)
	
	/**
	Initialize
	*/
	void SetDeviceState(void)
	{
		ucDeviceStateFlag = DEVICE_STATUS_NEEDED;
	}

	/**
	Initialize communication with the ACA machines
	*/
	void DevicePoll(void)
	{
		SQACAMachineStatusCommSequence();					//SQ Payment System Driven Vending
		macSetAlarm(DEVICE_POLL_PERIOD,SetDeviceState);		//300ms
	}
	
	

	
	#endif // ifndef COORDNODE

	
	/** @} */
